Revit 2024 API
StructuralSectionGeneralI Class
 Defines parameters for general Double T shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionGeneralI : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionGeneralI _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionGeneralI : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
See Also
StructuralSectionGeneralI Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace